In [2]:
import pandas as pd 
ds = pd.read_excel('C:\\Users\\ENG. MAYADA\\Downloads\\titanic Dataset.xlsx')
ds.head()

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0            1         0       3    male  22.0      1      0   7.2500
1            2         1       1  female  38.0      1      0  71.2833
2            3         1       3  female  26.0      0      0   7.9250
3            4         1       1  female  35.0      1      0  53.1000
4            5         0       3    male  35.0      0      0   8.0500

In [19]:
ds.isnull()

     PassengerId  Survived  Pclass    Sex    Age  SibSp  Parch   Fare
0          False     False   False  False  False  False  False  False
1          False     False   False  False  False  False  False  False
2          False     False   False  False  False  False  False  False
3          False     False   False  False  False  False  False  False
4          False     False   False  False  False  False  False  False
..           ...       ...     ...    ...    ...    ...    ...    ...
886        False     False   False  False  False  False  False  False
887        False     False   False  False  False  False  False  False
888        False     False   False  False   True  False  False  False
889        False     False   False  False  False  False  False  False
890        False     False   False  False  False  False  False  False

[891 rows x 8 columns]

In [22]:
ds.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Sex              0
Age            177
SibSp            0
Parch            0
Fare             3
dtype: int64

In [23]:
ds.isnull().sum().sum()

180

In [33]:
new_ds=ds.fillna(method="ffill")
new_ds

     PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0              1         0       3    male  22.0      1      0   7.2500
1              2         1       1  female  38.0      1      0  71.2833
2              3         1       3  female  26.0      0      0   7.9250
3              4         1       1  female  35.0      1      0  53.1000
4              5         0       3    male  35.0      0      0   8.0500
..           ...       ...     ...     ...   ...    ...    ...      ...
886          887         0       2    male  27.0      0      0  13.0000
887          888         1       1  female  19.0      0      0  30.0000
888          889         0       3  female  19.0      1      2  23.4500
889          890         1       1    male  26.0      0      0  30.0000
890          891         0       3    male  32.0      0      0   7.7500

[891 rows x 8 columns]

In [34]:
new_ds.isnull().sum().sum()

0